circircir-circle/human_exist_device/ESP32_LD2410/src/main.cpp
/*
    Video: https://www.youtube.com/watch?v=oCMOYS71NIU
    Based on Neil Kolban example for IDF: https://github.com/nkolban/esp32-snippets/blob/master/cpp_utils/tests/BLE%20Tests/SampleNotify.cpp
    Ported to Arduino ESP32 by Evandro Copercini
   Create a BLE server that, once we receive a connection, will send periodic notifications.
   The service advertises itself as: 6E400001-B5A3-F393-E0A9-E50E24DCCA9E
   Has a characteristic of: 6E400002-B5A3-F393-E0A9-E50E24DCCA9E - used for receiving data with "WRITE"
   Has a characteristic of: 6E400003-B5A3-F393-E0A9-E50E24DCCA9E - used to send data with  "NOTIFY"
   The design of creating the BLE server is:
   1. Create a BLE Server
   2. Create a BLE Service
   3. Create a BLE Characteristic on the Service
   4. Create a BLE Descriptor on the characteristic
   5. Start the service.
   6. Start advertising.
   In this example rxValue is the data received (only accessible inside that function).
   And txValue is the data to be sent, in this example just a byte incremented every second.
*/

#include <Arduino.h>

#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <ArduinoNvs.h>
#include <WiFi.h>
#include <Preferences.h>
#include <esp32-hal-cpu.h>
//#include <ESPmDNS.h>
//#include <WebServer.h>
//#include <WiFiMulti.h>
//#include "esp_http_client.h"
// #include <ArduinoJson.h>

// String chipId;
//  See the following for generating UUIDs:
//  https://www.uuidgenerator.net/
#define SERVICE_UUID_wifi                 "6E400001-B5A3-F393-E0A9-E50E24DCCA9E" // UART service UUID
#define SERVICE_UUID_LD2410               "6E400002-B5A3-F393-E0A9-E50E24DCCA9E" // UART service UUID
#define CHARACTERISTIC_UUID_Wifi_ssid     "dea04111-ffce-4152-b6b1-9049eefdd97a"
#define CHARACTERISTIC_UUID_Wifi_Pwd      "81f0b721-56d7-4b82-a2f1-d53f9911fe8b"
#define CHARACTERISTIC_UUID_MQTT_Site     "60fdb096-901d-4fc3-85b0-cc5ce6b5d037"
#define CHARACTERISTIC_UUID_MQTT_port     "6925960c-ac10-41cb-ad88-bb762c9f16c6"
#define CHARACTERISTIC_UUID_MQTT_Account  "f91ae54a-4882-48ff-b0e0-fd1f0fb1cf0d"
#define CHARACTERISTIC_UUID_MQTT_pwd      "f10e9de3-7ceb-4ce5-8b43-e2f517296e32"
#define CHARACTERISTIC_UUID_LD2410_Th     "e0f956da-2708-488d-bcc5-dd8b19676222"
#define CHARACTERISTIC_UUID_LD2410_Status "921af35a-4165-4f5b-988f-91cb5733a485"
#define CHARACTERISTIC_UUID_Net_States    "df460c3e-50ae-466c-a503-cac4c01d5398"
#define CHARACTERISTIC_UUID_Judge_Params  "c015a05b-9617-455a-97ad-4e44ea286cd2"
#define CHARACTERISTIC_UUID_Send_CMD      "c015a05c-9617-455a-97ad-4e44ea286cd2"
#define CHARACTERISTIC_UUID_LD2410_Result "c015a05d-9617-455a-97ad-4e44ea286cd2"

#define AP_SSID  "esp32"

RTC_DATA_ATTR int bootCount = 0;

const int led1 = 12;
const int led2 = 13;
const int rxpin = 1;
const int txpin = 0;
const int ldrPin = 2;

const int mqtt_period = 10 * 60;     //单位:s,  表示 mqtt 每隔5min发送一次
const int serial_period = 2;    //单位:s,  表示 串口 每隔2s发送一次
const int ldr_period = 10;    //单位:s,  表示 ldr 每隔10s检测一次

// NVS 区域, 存储 wifi 和 mqtt 信息
Preferences preferences;
esp_sleep_wakeup_cause_t wakeup_reason;

// mqtt
WiFiClient espClient;
PubSubClient mqttclient(espClient);

//蓝牙控制
int resr_count_down = 120;
int ble_inited = 0;
TimerHandle_t xTimer_rest;

BLEServer *pServer = NULL;
BLEService *pService_wifi = NULL;
BLEService *pService_LD2410 = NULL;
BLECharacteristic *pWifi_ssidCharacteristic;
BLECharacteristic *pWifi_PwdCharacteristic;
BLECharacteristic *pMQTT_SiteCharacteristic;
BLECharacteristic *pMQTT_portCharacteristic;
BLECharacteristic *pMQTT_AccountCharacteristic;
BLECharacteristic *pMQTT_pwdCharacteristic;

BLECharacteristic *pLD2410_ThCharacteristic;
BLECharacteristic *pLD2410_StatusCharacteristic;
BLECharacteristic *pNet_StatesCharacteristic;
BLECharacteristic *pJudge_ParamsCharacteristic;
BLECharacteristic *pSend_CMDCharacteristic;
BLECharacteristic *pLD2410_ResultCharacteristic;
bool deviceConnected = false;
bool oldDeviceConnected = false;

//蓝牙通信 buf 
uint8_t txValue = 0;
uint8_t txbuf[25] = {0};
uint8_t NetState[2] = {0, 0}; // byte[0] 表示 wifi 状态, [1]表示mqtt状态
String resStr;
String chipId;
String readString;
String wifi_ssid;
String wifi_pwd;
String mqtt_site;
uint16_t mqtt_port;
String mqtt_account;
String mqtt_pwd;

// mqtt 通信 buf

// LD2410 通信buf
int ldr_value = 0;
char read_buf[100];
char open_engineering_pattern_cmd[12] = {0xFD, 0xFC, 0xFB, 0xFA, 0x02, 0x00, 0x62, 0x00, 0x04, 0x03, 0x02, 0x01};
char config_LD2410_cmd[14] = {0xFD, 0xFC, 0xFB, 0xFA, 0x04, 0x00, 0xFF, 0x00, 0x61, 0x00, 0x04, 0x03, 0x02, 0x01};
char unconfig_LD2410_cmd[14] = {0xFD, 0xFC, 0xFB, 0xFA, 0x02, 0x00, 0xFE, 0x00, 0x04, 0x03, 0x02, 0x01};
const int t_s = 19;
const int s_s = 30;
const int org_state_p = 8;
const int M_D_p = 9;
const int M_S_p = 11;
const int ML_D_p = 12;
const int ML_S_p = 14;
const int distance_p = 15;



// LD2410 状态及判定
uint8_t LD2410_th[18] = {0, 1, 2, 3};   // 前9个是运动状态, 后9个是静止状态

// 分别是持续多少次判定有人运动状态, 持续多少次判定有人静止状态, 持续多少次判定无人运动状态, 持续多少次判定无人静止状态
uint8_t continue_times[4] = {10, 10, 10, 10}; 

// 第一个是状态: 0 无人, 1 有人静止 2 有人运动 
// 后面两个是猜测运动状态距离, 猜测静止状态距离
uint8_t LD2410_result[3] = {0, 1, 2};
int sb_move, sb_not_move, sb_silent, sb_not_silent = 0;   

// 临时变量
// int i = 0;
int alive_state = 0;
int silent_state = 1;
int raw_data = 0;
int old_state = 0;
int mqtt_cnt = 0;
int serial_cnt = 0;
int ldr_cnt = 0;

void initBLE();
void MqttRecvCallback(char *topic, byte *payload, unsigned int length);
int StartWifiMqtt();
void restCallback(TimerHandle_t xTimer);
void updata_BLECharacteristic();
void updata_data_from_nvs();
void updata_BLE_Net_State();
void proc_LD2410_data();
void WiFiEvent(WiFiEvent_t event);
void open_LD2410_engineering_mode();

// service 的回调函数, 接入将提示, 断开就重启
class MyServerCallbacks : public BLEServerCallbacks
{
  void onConnect(BLEServer *pServer)
  {
    deviceConnected = true;
    resr_count_down = 999999999;    // 一旦连接, 把该值设置到足够大, 避免断开蓝牙
    oldDeviceConnected = deviceConnected;
    Serial.println("现在有设备接入~");
  };

