circircir-circle/human_exist_device/ESP32_LD2410/src/main.cpp
  void onDisconnect(BLEServer *pServer)
  {
    deviceConnected = false;
    delay(500);                  // give the bluetooth stack the chance to get things ready
    resr_count_down = 120;   // 客户端断开蓝牙2分钟后, 设备将关闭蓝牙
    Serial.println("disconnected client, reset esp32");
//    ESP.restart();
    pServer->startAdvertising(); // restart advertising
    Serial.println("start advertising");
    oldDeviceConnected = deviceConnected;
  }
};


class MyCallbacksWifi_ssid : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("wifi_ssid", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("Wifi_ssid Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }

  }
};

class MyCallbacksWifi_Pwd : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("wifi_pwd", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("Wifi_Pwd Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksMQTT_Site : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("mqtt_site", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("MQTT_Site Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksMQTT_port : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    uint16_t t;
    std::string rxValue = pCharacteristic->getValue();
    t = atoi(rxValue.c_str());
    preferences.putInt("mqtt_port", t);

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("MQTT_port Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksMQTT_Account : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("mqtt_account", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("MQTT_Account Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksMQTT_pwd : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    int sta;
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("mqtt_pwd", rxValue.c_str());
    Serial.printf("write mqtt_pwd to NVS = %s \n\r", rxValue.c_str());
    Serial.println("StartWifiMqtt.......");
    sta = StartWifiMqtt();
    Serial.printf("StartWifiMqtt return %d.......\n\r", sta);

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("MQTT_pwd Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksLD2410_Th : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("LD2410_Th Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.printf("%d, ", rxValue[i]);
        LD2410_th[i] = rxValue[i] > 100 ? 100 : rxValue[i];
      }
      preferences.putBytes("LD2410_th", LD2410_th, 18);
      Serial.println();
      Serial.println("*********");
    }
  }
};

class MyCallbacksJudge_Params : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("Judge_Params", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("Judge_Params Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.printf("%d", rxValue[i]);
        continue_times[i] = rxValue[i];
      }
      preferences.putBytes("continue_times", continue_times, sizeof(continue_times));
      Serial.println();
      Serial.println("*********"); 
    }
  }
};

class MyCallbacksSend_CMD : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  { //* 客户端写入事件回调函数
    std::string rxValue = pCharacteristic->getValue();
    preferences.putString("Send_CMD", rxValue.c_str());

    if (rxValue.length() > 0)
    {
      // 打印接收内容
      Serial.println("*********");
      Serial.print("Send_CMD Received Value: ");
      for (int i = 0; i < rxValue.length(); i++)
      {
        Serial.print(rxValue[i]);
        resStr += rxValue[i];
      }
      Serial.println();
      Serial.println("*********"); 
    }

    // byte[0] = 0x01:  请求上传当前网络信息, LD2410配置信息
    if (rxValue[0] == 0x01)
    {
      updata_BLECharacteristic();
    }
  }
};

void setup()
{
  int p = 0;
  int sta = 0;
  String wifi_ssid = "";
  String wifi_pwd = "";
  String mqtt_site = "";
  int mqtt_port = 0;
  String mqtt_account = "";
  String mqtt_pwd = "";byte mac[6];
  WiFi.macAddress(mac);
  String uniq =  String(mac[0],HEX) +String(mac[1],HEX) +String(mac[2],HEX) +String(mac[3],HEX) + String(mac[4],HEX) + String(mac[5],HEX);
  //!--------- 以下为初始化部分
  
  preferences.begin("sp_data", false);
  Serial.begin(115200);  
  WiFi.onEvent(WiFiEvent);
  setCpuFrequencyMhz(160);
  esp_sleep_enable_timer_wakeup(100 * 1000);
  WiFi.setSleep(WIFI_PS_MIN_MODEM);
  Serial1.begin(256000, SERIAL_8N1, rxpin, txpin);
  pinMode(led1, OUTPUT);
  digitalWrite(led1, 0);
//  chipId = String((uint32_t)ESP.getEfuseMac(), HEX);
  chipId = uniq;
  chipId.toUpperCase();
  //  chipid =ESP.getEfuseMac();  
  Serial.println("---------------> run V1.1.0 on 20220806 <-------------");
  Serial.printf("Chip id: %s\n", chipId.c_str());
  Serial.println(chipId);

  ++bootCount;
  wakeup_reason = esp_sleep_get_wakeup_cause();
  switch(wakeup_reason)
  {
    case ESP_SLEEP_WAKEUP_EXT0 : Serial.println("Wakeup caused by external signal using RTC_IO"); break;
    case ESP_SLEEP_WAKEUP_EXT1 : Serial.println("Wakeup caused by external signal using RTC_CNTL"); break;
    case ESP_SLEEP_WAKEUP_TIMER : Serial.println("Wakeup caused by timer"); break;
    case ESP_SLEEP_WAKEUP_TOUCHPAD : Serial.println("Wakeup caused by touchpad"); break;
    case ESP_SLEEP_WAKEUP_ULP : Serial.println("Wakeup caused by ULP program"); break;
    default : Serial.printf("Wakeup was not caused by deep sleep: %d\n",wakeup_reason); break;
  }

  if (wakeup_reason == ESP_SLEEP_WAKEUP_UNDEFINED)
  {
    initBLE();  
    xTimer_rest = xTimerCreate("xTimer_rest", 1000 / portTICK_PERIOD_MS, pdTRUE, ( void * ) 0, restCallback);
    xTimerStart(xTimer_rest, 0 );  //开启定时器
    Serial.println("start a timer...");
  } 

  //!------- 尝试从 nvs 区域读取wifi信息, 并连接wifi
  Serial.println("try to connect to wifi...");
  sta = StartWifiMqtt();

  delay(1000);
  // V1.1.0 新版LD2410需要手动打开工程模式, 才能得到每个距离门上的能量值
  open_LD2410_engineering_mode();
}

void loop()
{
  char msg[100];
  char title[100];
  delay(100); 
  // V1.0.3  加入条件判断: 只有当自动重启后, 或者蓝牙已关闭的情况, 才引入自动重启机制
  if ((bootCount > 1) || (resr_count_down <= 0)) {
    // V1.0.2  发现设备有几率失联的问题, 因此当检测到断网或者连不上mqtt时, 自动重启
    if ((WiFi.status() != WL_CONNECTED) || (mqttclient.loop() == false))
    {
      Serial.println("network have encounted critical errors");
      esp_deep_sleep_start();
    }
  }
  if (resr_count_down < 0)
  {
    xTimerStop(xTimer_rest, 0);
    Serial.println("stop the timer to wait ble");
    Serial.println("esp32 will be restarted");
    esp_deep_sleep_start();
  }
  while (1) 
  {
    Serial1.read(read_buf, 45);
//    Serial.printf("read_buf: ");
//    for (int i = 0; i < 45; i++)
//    {
//      Serial.printf("0x%02x ", read_buf[i]);
//    }
//    Serial.println(" "); 
    if ((read_buf[0] == 0xF4) && (read_buf[1] == 0xF3) && (read_buf[2] == 0xF2) && (read_buf[3] == 0xF1))
    {      
      // 如果工程模式打开失败, 收到的还是正常模式的数据, 则再次尝试打开工程模式
      if ((read_buf[19] == 0xF8) && (read_buf[20] == 0xF7) && (read_buf[21] == 0xF6) && (read_buf[22] == 0xF5))
      {
        open_LD2410_engineering_mode();
      }
//      Serial.println("it's valid frame"); 
      break;
    }
//    Serial.println("warning: it's unvalid frame, read again"); 
  }
  proc_LD2410_data();
  // Reading potentiometer value
  if (ldr_cnt++ > ldr_period * 10)
  {
    ldr_cnt = 0;
    ldr_value = 0;
    for (int i = 0; i < 32; i++)
    {
      ldr_value = ldr_value + analogRead(ldrPin);
    }
    ldr_value = ldr_value >> 5;
  }
  

  if (serial_cnt++ > serial_period * 10)
  {
    serial_cnt = 0;
    Serial.printf("ldr_value = %d, sb_move = %d, sb_not_move = %d, sb_silent = %d, sb_not_silent =  = %d, result = %d\n\r", ldr_value, sb_move, sb_not_move, sb_silent, sb_not_silent, LD2410_result[0]);
    Serial.printf("cpu freq = %d MHz\n\r", getCpuFrequencyMhz());
  }
  
  if ((mqtt_cnt++ > mqtt_period * 10) or (old_state != LD2410_result[0])) // mqtt_period * 10
  {
    mqtt_cnt = 0;
    sprintf(msg, "{ \"human_exist\": %d, \"ldr_value\": %d, \"boot_count\": %d}", LD2410_result[0], ldr_value, bootCount);
    sprintf(title, "homeassistant/sensor/ESP32_ID%s/state", chipId);
    mqttclient.publish(title, msg);
    Serial.println("push to mqtt");
  }
  old_state = LD2410_result[0]; 

