circircir-circle/human_exist_device/ESP32_LD2410/src/main.cpp
  size_t blobLength = preferences.getBytesLength("LD2410_th");
  Serial.printf("blobLength = %d, sizeof(LD2410_th) = %d\n\r", blobLength, sizeof(LD2410_th));
  if (blobLength == 18)
  {
    Serial.printf("buf addr = %x\n\r", LD2410_th);
    ok = preferences.getBytes("LD2410_th", LD2410_th, 18);
    Serial.printf("read LD2410_th from NVS = %d\n\r", ok);
    for (i = 0; i < 18; i++)
    {
      Serial.printf("%d, ", LD2410_th[i]);
    }
    Serial.println();
  }
  else
  {
    Serial.println("LD2410_th bolb save error");
  }  

  blobLength = preferences.getBytesLength("continue_times");
  Serial.printf("blobLength = %d, sizeof(continue_times) = %d\n\r", blobLength, sizeof(continue_times));
  if (blobLength == 4)
  {
    ok = preferences.getBytes("continue_times", continue_times, 4);
    Serial.printf("read continue_times from NVS = %d\n\r", ok);
    for (i = 0; i < 4; i++)
    {
      Serial.printf("%d, ", continue_times[i]);
    }
    Serial.println();
  }
  else
  {
    Serial.println("continue_times bolb save error");
  } 
}

void updata_BLECharacteristic(void)
{
  char t[20];
  uint8_t *pu8_t;

  // 从 NVS 取数据
  wifi_ssid.toCharArray(t, 20);
  pWifi_ssidCharacteristic->setValue((uint8_t *)t, wifi_ssid.length());  
  Serial.printf("set pWifi_ssidCharacteristic = %s\n\r", t);  
  pWifi_ssidCharacteristic->notify();
  
  wifi_pwd.toCharArray(t, 20);
  pWifi_PwdCharacteristic->setValue((uint8_t *)t, wifi_pwd.length());
  Serial.printf("set pWifi_PwdCharacteristic = %s\n\r", t);
  pWifi_PwdCharacteristic->notify();
  
  mqtt_site.toCharArray(t, 20);
  pMQTT_SiteCharacteristic->setValue((uint8_t *)t, mqtt_site.length());
  Serial.printf("set pMQTT_SiteCharacteristic = %s\n\r", t);
  pMQTT_SiteCharacteristic->notify();
  pMQTT_portCharacteristic->setValue(mqtt_port);
  Serial.printf("set pMQTT_portCharacteristic = %d\n\r", mqtt_port);
  pMQTT_portCharacteristic->notify();
  
  mqtt_account.toCharArray(t, 20);
  pMQTT_AccountCharacteristic->setValue((uint8_t *)t, mqtt_account.length());
  Serial.printf("set pMQTT_AccountCharacteristic = %s\n\r", t);
  pMQTT_AccountCharacteristic->notify();
  
  mqtt_pwd.toCharArray(t, 20);
  pMQTT_pwdCharacteristic->setValue((uint8_t *)t, mqtt_pwd.length());
  Serial.printf("set pMQTT_pwdCharacteristic = %s\n\r", t);
  pMQTT_pwdCharacteristic->notify();

  pNet_StatesCharacteristic->setValue((uint8_t *)NetState, 2);
  pNet_StatesCharacteristic->notify();

  pLD2410_ThCharacteristic->setValue((uint8_t *)LD2410_th, 18);
  pLD2410_ThCharacteristic->notify();

  pJudge_ParamsCharacteristic->setValue((uint8_t *)continue_times, sizeof(continue_times));
  pJudge_ParamsCharacteristic->notify();
}

void updata_BLE_Net_State()
{
  if (deviceConnected)
  {
    Serial.println("updata net states");
    pNet_StatesCharacteristic->setValue((uint8_t *)NetState, 2);
    pNet_StatesCharacteristic->notify();
  }
}

void proc_LD2410_data()
{
  int diff[18];
  int i;
  for (i = 0; i < 9; i++)
  {
    diff[i] = read_buf[t_s + i] - LD2410_th[i];
    diff[9 + i] = read_buf[s_s + i] - LD2410_th[9 + i];
  }
  for (i = 0; i < 9; i++)
  {
    if (diff[i] > 0)
    {
      break;
    }
  }
  if (i < 9)
  {
    sb_move++;    
    if (sb_move > continue_times[0])
    {
      sb_not_move = 0;
    }
  }
  else
  {
    sb_not_move++;
    if (sb_not_move > continue_times[1])
    {
      sb_move = 0;
    }
  }
  for (i = 0; i < 9; i++)
  {
    if (diff[9 + i] > 0)
    {
      break;
    }
  }
  if (i < 9)
  {
    sb_silent++;    
    if (sb_silent > continue_times[2])
    {
      sb_not_silent = 0;
    }
  }
  else
  {
    sb_not_silent++;
    if (sb_not_silent > continue_times[3])
    {
      sb_silent = 0;
    }
  }
  if (sb_move > continue_times[0])
  {
    LD2410_result[0] = 2;  // 表示有人运动
  }
  else if (sb_silent > continue_times[2])
  {
    LD2410_result[0] = 1;  // 表示有人静止
  }
  else if (sb_not_move > continue_times[1] && sb_not_silent > continue_times[3])
  {
    LD2410_result[0] = 0;  // 表示无人
  }
  else
  {
    LD2410_result[0] = LD2410_result[0];
  }
}

void WiFiEvent(WiFiEvent_t event)
{
    switch(event) {
        case ARDUINO_EVENT_WIFI_AP_START:
            Serial.println("AP Started");
//            WiFi.softAPsetHostname(AP_SSID);
            break;
        case ARDUINO_EVENT_WIFI_AP_STOP:
            Serial.println("AP Stopped");
            break;
        case ARDUINO_EVENT_WIFI_STA_START:
            Serial.println("STA Started");
//            WiFi.setHostname(AP_SSID);
            break;
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            Serial.println("STA Connected");
//            WiFi.enableIpV6();
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
            Serial.print("STA IPv6: ");
            Serial.println(WiFi.localIPv6());
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            Serial.print("STA IPv4: ");
            Serial.println(WiFi.localIP());
            break;
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            Serial.println("STA Disconnected");
            break;
        case ARDUINO_EVENT_WIFI_STA_STOP:
            Serial.println("STA Stopped");
            break;
        default:
            break;
    }
}

void open_LD2410_engineering_mode() 
{
  // 开启LD2410的工程模式
  Serial1.write(config_LD2410_cmd, sizeof(config_LD2410_cmd));
  delay(100);
  Serial1.write(open_engineering_pattern_cmd, sizeof(open_engineering_pattern_cmd));
  delay(100);
  Serial1.write(unconfig_LD2410_cmd, sizeof(unconfig_LD2410_cmd));  
  delay(100);
}
